# WireframeBuilder Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireframeBuilder Class
Members See Also
---
Constructs a shape representation consisting of points and curves. That shape would typically be stored in a DirectShape or a DirectShapeType object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class WireframeBuilder : ShapeBuilder
```

Visual Basic
---
```text
Public Class WireframeBuilder _
	Inherits ShapeBuilder
```

Visual C++
---
```text
public ref class WireframeBuilder : public ShapeBuilder
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ShapeBuilder Autodesk.Revit.DB..::..WireframeBuilder
# See Also
WireframeBuilder Members
Autodesk.Revit.DB Namespace